Repository: nyerou/yourls.frontend-links
Catalog: languages/frontend-links-*.po
Languages: fr_fr

source: Installation complete! Tables and default data have been created.
fr_fr: Installation terminée ! Les tables et données par défaut ont été créées.

source: Frontend Links - Installation required
fr_fr: Frontend Links - Installation requise

source: The plugin tables have not yet been created in the database.
fr_fr: Les tables du plugin n'ont pas encore été créées dans la base de données.

source: Create the Frontend Links plugin tables?
fr_fr: Créer les tables du plugin Frontend Links ?

source: Install plugin
fr_fr: Installer le plugin

source: Title
fr_fr: Titre

source: Links
fr_fr: Liens

source: Order
fr_fr: Ordre

source: Active
fr_fr: Actif

source: Yes
fr_fr: Oui

source: No
fr_fr: Non

source: Edit
fr_fr: Modifier

source: Delete
fr_fr: Supprimer

source: No sections.
fr_fr: Aucune section.

source: + Add a section
fr_fr: + Ajouter une section

source: + Add a link
fr_fr: + Ajouter un lien

source: No links in this section.
fr_fr: Aucun lien dans cette section.

source: Icon
fr_fr: Icône

source: Label
fr_fr: Libellé

source: Profile
fr_fr: Profil

source: Name
fr_fr: Nom

source: Current avatar
fr_fr: Avatar actuel

source: current
fr_fr: actuel

source: Previous avatar
fr_fr: Avatar précédent

source: previous
fr_fr: précédent

source: Upload an image:
fr_fr: Uploader une image :

source: max 2 MB.
fr_fr: max 2 Mo.

source: Or external URL:
fr_fr: Ou URL externe :

source: Delete avatar
fr_fr: Supprimer l'avatar

source: Restore previous
fr_fr: Restaurer le précédent

source: SEO Title
fr_fr: Titre SEO

source: SEO Description
fr_fr: Description SEO

source: Save profile
fr_fr: Enregistrer le profil

source: Icons
fr_fr: Icônes

source: Built-in icons (Font Awesome)
fr_fr: Icônes intégrées (Font Awesome)

source: Available by default. Cannot be deleted.
fr_fr: Disponibles par défaut. Non supprimables.

source: Custom icons
fr_fr: Icônes personnalisées

source: No custom icons.
fr_fr: Aucune icône personnalisée.

source: Preview
fr_fr: Aperçu

source: + Add an icon
fr_fr: + Ajouter une icône

source: Display mode
fr_fr: Mode d'affichage

source: Manual
fr_fr: Manuel

source: Include <code>fl_render_page()</code> in an external PHP file.
fr_fr: Incluez <code>fl_render_page()</code> dans un fichier PHP externe.

source: Automatic
fr_fr: Automatique

source: The plugin serves the page at <code>/</code>.
fr_fr: Le plugin sert la page sur <code>/</code>.

source: Save mode
fr_fr: Enregistrer le mode

source: Short links
fr_fr: Liens courts

source: When a link is entered without a protocol (e.g.: <code>git</code>), the YOURLS domain is added automatically.
fr_fr: Quand un lien est saisi sans protocole (ex : <code>git</code>), le domaine YOURLS est ajouté automatiquement.

source: Include subdirectory
fr_fr: Inclure le sous-dossier

source: Include <code>%s</code> in URLs
fr_fr: Inclure <code>%s</code> dans les URLs

source: unchecked
fr_fr: décoché

source: checked
fr_fr: coché

source: Save
fr_fr: Enregistrer

source: Information
fr_fr: Informations

source: YOURLS Site
fr_fr: Site YOURLS

source: Detected path
fr_fr: Chemin détecté

source: (root)
fr_fr: (racine)

source: Uploads folder
fr_fr: Dossier uploads

source: Current mode
fr_fr: Mode actuel

source: Automatic (/)
fr_fr: Automatique (/)

source: Auto index.php file
fr_fr: Fichier index.php auto

source: Add a section
fr_fr: Ajouter une section

source: Section name
fr_fr: Nom de la section

source: Add
fr_fr: Ajouter

source: Cancel
fr_fr: Annuler

source: Edit section
fr_fr: Modifier la section

source: Add a link
fr_fr: Ajouter un lien

source: My link
fr_fr: Mon lien

source: Without a protocol, the YOURLS domain will be added.
fr_fr: Sans protocole, le domaine YOURLS sera ajouté.

source: Edit link
fr_fr: Modifier le lien

source: Add a custom icon
fr_fr: Ajouter une icône personnalisée

source: Lowercase letters, numbers, _ and -. This name will be used to select the icon.
fr_fr: Minuscules, chiffres, _ et -. Ce nom sera utilisé pour sélectionner l'icône.

source: SVG code
fr_fr: Code SVG

source: Use %s for theme adaptation.
fr_fr: Utilisez %s pour l'adaptation au thème.

source: Image file
fr_fr: Fichier image

source: max 1 MB.
fr_fr: max 1 Mo.

source: Add icon
fr_fr: Ajouter l'icône

source: Delete this link?
fr_fr: Supprimer ce lien ?

source: Delete this section and all its links?
fr_fr: Supprimer cette section et tous ses liens ?

source: Delete this icon?
fr_fr: Supprimer cette icône ?

source: Delete the current avatar?
fr_fr: Supprimer l'avatar actuel ?

source: Restore the previous avatar?
fr_fr: Restaurer l'avatar précédent ?

source: Connection error.
fr_fr: Erreur de connexion.

source: Unauthorized. Please log in again.
fr_fr: Non autorisé. Reconnectez-vous.

source: Session expired. Please reload the page.
fr_fr: Session expirée. Rechargez la page.

source: Invalid request.
fr_fr: Requête invalide.

source: Unknown action.
fr_fr: Action inconnue.

source: Link added.
fr_fr: Lien ajouté.

source: Error adding item.
fr_fr: Erreur lors de l'ajout.

source: Link updated.
fr_fr: Lien modifié.

source: Error updating item.
fr_fr: Erreur lors de la modification.

source: Link deleted.
fr_fr: Lien supprimé.

source: Error deleting item.
fr_fr: Erreur lors de la suppression.

source: Section added.
fr_fr: Section ajoutée.

source: Section updated.
fr_fr: Section modifiée.

source: Section deleted.
fr_fr: Section supprimée.

source: Icon deleted.
fr_fr: Icône supprimée.

source: Automatic mode enabled.
fr_fr: Mode automatique activé.

source: Manual mode enabled.
fr_fr: Mode manuel activé.

source: Option updated.
fr_fr: Option mise à jour.

source: Upload error. Formats: JPG, PNG, GIF, WebP, SVG. Max 2 MB.
fr_fr: Erreur d'upload. Formats : JPG, PNG, GIF, WebP, SVG. Max 2 Mo.

source: Profile updated.
fr_fr: Profil mis à jour.

source: Avatar deleted.
fr_fr: Avatar supprimé.

source: Previous avatar restored.
fr_fr: Avatar précédent restauré.

source: No previous avatar.
fr_fr: Aucun avatar précédent.

source: Name required (lowercase letters, numbers, _ and -).
fr_fr: Nom obligatoire (minuscules, chiffres, _ et -).

source: Invalid or empty SVG code.
fr_fr: Code SVG invalide ou vide.

source: No file selected.
fr_fr: Aucun fichier sélectionné.

source: Upload error. Formats: JPG, PNG, GIF, WebP, SVG. Max 1 MB.
fr_fr: Erreur d'upload. Formats : JPG, PNG, GIF, WebP, SVG. Max 1 Mo.

source: Icon "%s" added.
fr_fr: Icône « %s » ajoutée.

source: Error: name already in use?
fr_fr: Erreur : nom déjà utilisé ?

source: Installation required
fr_fr: Installation requise

source: The Frontend Links plugin is not yet installed.
fr_fr: Le plugin Frontend Links n'est pas encore installé.

source: Go to admin to install
fr_fr: Accéder à l'admin pour installer

source: My Profile
fr_fr: Mon Profil

source: - Links
fr_fr: - Liens

source: An index.php file already exists at the root and was not created by this plugin. Delete it manually or use manual mode.
fr_fr: Un fichier index.php existe déjà à la racine et n'a pas été créé par ce plugin. Supprimez-le manuellement ou utilisez le mode manuel.

source: Unable to write the index.php file. Check folder permissions.
fr_fr: Impossible d'écrire le fichier index.php. Vérifiez les permissions du dossier.

source: index.php file created: %s
fr_fr: Fichier index.php créé : %s

source: No file to delete.
fr_fr: Aucun fichier à supprimer.

source: The index.php file has been manually modified. Deletion cancelled for safety.
fr_fr: Le fichier index.php a été modifié manuellement. Suppression annulée par sécurité.

source: Unable to delete the file. Check permissions.
fr_fr: Impossible de supprimer le fichier. Vérifiez les permissions.

source: index.php file deleted.
fr_fr: Fichier index.php supprimé.

source: Unable to write the .htaccess file. Short URLs at the root may not work.
fr_fr: Impossible d'écrire le fichier .htaccess. Les URLs courtes à la racine peuvent ne pas fonctionner.

source: Auto mode index.php not found. Enable auto mode first.
fr_fr: Fichier index.php du mode auto introuvable. Activez d'abord le mode auto.

source: A robots.txt already exists and was not created by this plugin. Delete it manually to enable auto-generation.
fr_fr: Un fichier robots.txt existe déjà et n'a pas été créé par ce plugin. Supprimez-le manuellement pour activer la génération automatique.

source: Unable to write the robots.txt file. Check folder permissions.
fr_fr: Impossible d'écrire le fichier robots.txt. Vérifiez les permissions du dossier.

source: robots.txt generated: %s
fr_fr: robots.txt généré : %s

source: Theme changed to "%s".
fr_fr: Thème changé en « %s ».

source: Invalid theme.
fr_fr: Thème invalide.

source: Redirect options saved and .htaccess updated.
fr_fr: Options de redirection enregistrées et .htaccess mis à jour.

source: Options saved.
fr_fr: Options enregistrées.

source: Option saved and robots.txt regenerated.
fr_fr: Option enregistrée et robots.txt régénéré.

source: Options updated.
fr_fr: Options mises à jour.

source: Migration required
fr_fr: Migration requise

source: Settings structure update
fr_fr: Mise à jour de la structure des paramètres

source: %d option(s) found in yourls_options — action required to continue.
fr_fr: %d option(s) trouvée(s) dans yourls_options — action requise pour continuer.

source: Action required before continuing
fr_fr: Action requise avant de continuer

source: The plugin settings (<code>fl_*</code>) are currently stored in <code>yourls_options</code>, the global YOURLS table shared with the core and other plugins. The current version requires them to be in <code>frontend_settings</code>, the plugin's own private table.
fr_fr: Les paramètres du plugin (<code>fl_*</code>) sont actuellement stockés dans <code>yourls_options</code>, la table globale de YOURLS partagée avec le cœur et les autres plugins. La version actuelle nécessite qu'ils soient dans <code>frontend_settings</code>, la table privée du plugin.

source: Why this migration?
fr_fr: Pourquoi cette migration ?

source: Previous versions stored the plugin's configuration in <code>yourls_options</code> — YOURLS's global table — alongside core options and other plugins. This worked, but polluted a shared space and required multiple separate queries per page load.
fr_fr: Les versions précédentes stockaient la configuration du plugin dans <code>yourls_options</code> — la table globale de YOURLS — aux côtés des options du cœur et des autres plugins. Cela fonctionnait, mais polluait un espace partagé et nécessitait plusieurs requêtes distinctes par chargement de page.

source: The current version uses <code>frontend_settings</code> exclusively, a dedicated table created by the plugin. This avoids naming conflicts, improves performance (single cached load per request), and keeps the global table clean.
fr_fr: La version actuelle utilise exclusivement <code>frontend_settings</code>, une table dédiée créée par le plugin. Cela évite les conflits de nommage, améliore les performances (chargement unique mis en cache par requête) et maintient la table globale propre.

source: <strong>No data will be lost.</strong> Your current settings will be copied as-is to <code>frontend_settings</code>, then removed from <code>yourls_options</code>.
fr_fr: <strong>Aucune donnée ne sera perdue.</strong> Vos paramètres actuels seront copiés tels quels dans <code>frontend_settings</code>, puis supprimés de <code>yourls_options</code>.

source: Options to move (%d)
fr_fr: Options à déplacer (%d)

source: Yes, move the settings
fr_fr: Oui, déplacer les paramètres

source: No, deactivate the plugin
fr_fr: Non, désactiver le plugin

source: The plugin will be deactivated and you will need to reactivate it later to use it. Continue?
fr_fr: Le plugin sera désactivé et vous devrez le réactiver plus tard pour l'utiliser. Continuer ?

source: The plugin will be deactivated if you decline.
fr_fr: Le plugin sera désactivé si vous refusez.

source: Session expired. Please reload the page and try again.
fr_fr: Session expirée. Rechargez la page et réessayez.

source: Error
fr_fr: Erreur
